# ASSIGNMENT 6

It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'], 
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
              'Airline': ['KLM(!)', ' (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [4]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1) Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [23]:
pd.isnull(df.FlightNumber.loc[0,])

False

In [55]:
np.arange(1,df.From_To.count()+1)

array([1, 2, 3, 4, 5])

In [28]:
df.From_To.count()

5

In [50]:
new_index = np.arange(1,df['From_To'].count()+1)
df.set_index(new_index, inplace=True)
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN       10055.0            []                 (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [52]:
for i in np.arange(1,df.From_To.count()+1):
    if pd.isnull(df['FlightNumber'].loc[i,]):
        df.loc[i,'FlightNumber'] = df['FlightNumber'].loc[i-1,] + 10
df['FlightNumber']

1    10045.0
2    10055.0
3    10065.0
4    10075.0
5    10085.0
Name: FlightNumber, dtype: float64

In [62]:
df['FlightNumber'] = df['FlightNumber'].astype(int)
df['FlightNumber']

1    10045
2    10055
3    10065
4    10075
5    10085
Name: FlightNumber, dtype: int32

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [67]:
df['From_To'].loc[1].split('_')

['LoNDon', 'paris']

In [78]:
temporary_df = df.copy()

temporary_df[['From','To']] = temporary_df['From_To'].str.split('_',expand=True)

In [80]:
temporary_df

,From_To,FlightNumber,RecentDelays,Airline,From,To
1,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
2,MAdrid_miLAN,10055,[],(12),MAdrid,miLAN
3,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
4,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
5,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [82]:
temporary_df['From_To'] = temporary_df['From_To'].str.capitalize()

In [89]:
type(temporary_df['From'].loc[5])

str

In [91]:
temporary_df['From'] = temporary_df['From'].str.capitalize()

In [92]:
temporary_df['To'] = temporary_df['To'].str.capitalize()

In [93]:
temporary_df

,From_To,FlightNumber,RecentDelays,Airline,From,To
1,London_paris,10045,"[23, 47]",KLM(!),London,Paris
2,Madrid_milan,10055,[],(12),Madrid,Milan
3,London_stockholm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
4,Budapest_paris,10075,[13],12. Air France,Budapest,Paris
5,Brussels_london,10085,"[67, 32]","""Swiss Air""",Brussels,London

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [95]:
df.drop('From_To', axis=1, inplace=True)
df

   FlightNumber  RecentDelays              Airline
1         10045      [23, 47]               KLM(!)
2         10055            []                 (12)
3         10065  [24, 43, 87]  (British Airways. )
4         10075          [13]       12. Air France
5         10085      [67, 32]          "Swiss Air"

In [96]:
df['From_To'] = temporary_df['From_To']
df

   FlightNumber  RecentDelays              Airline           From_To
1         10045      [23, 47]               KLM(!)      London_paris
2         10055            []                 (12)      Madrid_milan
3         10065  [24, 43, 87]  (British Airways. )  London_stockholm
4         10075          [13]       12. Air France    Budapest_paris
5         10085      [67, 32]          "Swiss Air"   Brussels_london

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.